# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\007\Documents\PSoC Creator\Test1.cydsn\Test1.cyprj
# Date: Thu, 14 Nov 2019 08:07:50 GMT
#set_units -time ns
create_clock -name {H_Note(routed)} -period 2024291.6666666665 -waveform {0 1012145.83333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {A_Note(routed)} -period 2272708.333333333 -waveform {0 1136354.16666667} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {G_Note(routed)} -period 2551000 -waveform {0 1275500} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {F_Note(routed)} -period 2865333.333333333 -waveform {0 1432666.66666667} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {E_Note(routed)} -period 3030333.333333333 -waveform {0 1515166.66666667} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {D_Note(routed)} -period 3413000 -waveform {0 1706500} [list [get_pins {ClockBlock/dclk_5}]]
create_clock -name {C_Note(routed)} -period 4000000 -waveform {0 2000000} [list [get_pins {ClockBlock/dclk_6}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {H_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 48583 97167} -nominal_period 2024291.6666666665 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {A_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 54545 109089} -nominal_period 2272708.333333333 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {G_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61225 122449} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {C_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 96001 192001} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {Tempo_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1488001 3024001} [list [get_pins {ClockBlock/dclk_glb_7}]]
create_generated_clock -name {F_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 68769 137537} -nominal_period 2865333.333333333 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {E_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 72721 145457} -nominal_period 3030333.333333333 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {D_Note} -source [get_pins {ClockBlock/clk_sync}] -edges {1 81905 163825} [list [get_pins {ClockBlock/dclk_glb_5}]]


# Component constraints for C:\Users\007\Documents\PSoC Creator\Test1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\007\Documents\PSoC Creator\Test1.cydsn\Test1.cyprj
# Date: Thu, 14 Nov 2019 08:07:42 GMT
